[
    {
        "opinion_id": "12535429",
        "author": "g...6",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Instalacja łatwa. Oprogramowanie HP Smart bezproblemowe. Zwrot 100zl Cashback z Promocji po kilku dniach od zakupu. Skanuje. Drukuje. \nPrzez pierwsze 2-3 dni wszystko w porządku, wydruki czarne i kolorowe bardzo dobre. Po 3 dniu, zupełnie nagle, drukarka zaczyna drukować białe poziome kreski na wydrukach kolorowych. W czarnym bardzo dobrze. Wydruki w najlepszej jakości są bardzo dobre. Wydruki w jakości normalnej i roboczej są moim zdaniem wadliwe. Kupiłem 2 drukarki. Jedną udało mi się zwrócić w ramach 14 zwrotu. Druga niestety została. \nProducent HP raz uznał gwarancję. HP przysłałi nową głowicę kolorową, a jak problem nie został rozwiązany, całą nową drukarkę. Trzecia drukarka tak samo, drukuje białe kreski na wydrukach kolorowych. \nZgłoszone ponownie do HP, tym razem w ocenie wsparcia HP, drukarki atramentowe tak drukują... Pozostawię to bez komentarza. Chciałem zgłosić w ramach rękojmi, niezgodność produktu z umową (reklamują outstanding printing quality), ale niestety kupiłem na firmę i rękojmia jest wyłączona. Nie wiem czy wadliwa seria drukarek, głowic, oprogramowania czy może ja coś źle robię przy 1-szym uruchamianiu, ale HP nie chce poznać i rozwiązać problemu. Dobre jest to, że po kilku dniach, pierwsze strony wydruków wychodzą ok, a kreski pojawiają się dopiero na 3-4 stronie. Może z czasem się to poprawi samo, jeśli problemem jest zapowietrzenie głowicy lub aktualizacja oprogramowania sprzętowego... \nCo ciekawe, HP nie wymaga odciągania tuszy strzykawką do wysyłki drukarki a sklep tak. Drugi raz bym nie kupił, chyba że sprawdzoną przetestowaną.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "jakość wydruków"
        ],
        "vote_yes": 19,
        "vote_no": 3,
        "published": "2020-05-28 08:02:51",
        "purchased": "2020-05-04 22:29:44",
        "content_en": "Easy installation. HP Smart software trouble -free. Return of PLN 100 Cashback from the promotion a few days after purchase. Scans. Prints. \nFor the first 2-3 days everything is fine, black and colorful prints very good. After the 3rd day, quite suddenly, the printer begins to print white horizontal lines on colored prints. Very good in Czarny. Printouts in the best quality are very good. Prints in normal and working quality are in my opinion defective. I bought 2 printers. I managed to return one as part of the 14 return. The second unfortunately stayed. \nThe HP manufacturer once recognized the warranty. HP has sent a new colored head, and as the problem was not solved, the whole new printer. The third printer is the same, prints white lines on colored prints. \nReported to HP again, this time in the HP support assessment, inkjet printers print this way ... I will leave it without comment. I wanted to report as part of the warranty, the product's incompatibility with the contract (they advertise the Outstanding Printing Quality), but unfortunately I bought the company and the warranty is turned off. I do not know if a defective series of printers, heads, software or maybe I do something wrong with the 1st start, but HP does not want to know and solve the problem. It is good that after a few days, the first pages of the printout come out ok, and the lines appear only on the 3-4 page. Maybe over time it will improve by itself, if the problem is to announce the head or update the hardware software ... \nInterestingly, HP does not require pulling the carcass with a syringe for shipping the printer and the store yes. I wouldn't buy a second time, unless tested.",
        "pros_en": [
            "pure ink filling",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "Print quality"
        ]
    },
    {
        "opinion_id": "13551598",
        "author": "b...a",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wykonana dobrze, trochę za duża, z ledwością mieści mi się na biurku, ale może być. Drukuje ciszej w porównaniu z poprzednią drukarką HP 209a. Napełniłam tusze do pełna i po ok.10 kartkach ubyło mi 4 mm czarnego tuszu w pojemniku. Mam nadzieję, że będzie wydajna. Na razie nie mogę tego stwierdzić. Fajnie, że można zobaczyć, ile ubyło tuszu. Dolewanie jest banalnie proste, tusz nie wylewa się. Martwi mnie tylko, że przenosić trzeba ją w pozycji poziomej, bo inaczej tusz może się wylewać. Ogólnie jestem zadowolona z zakupu.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "głośność pracy"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 3,
        "published": "2020-12-10 19:41:04",
        "purchased": "2020-12-04 21:02:01",
        "content_en": "Made well, a bit too big, it barely fits on my desk, but it can be. Prints quieter compared to the previous HP 209A printer. I filled the inks to full and after about 10 cards I lost 4 mm black mascara in the container. I hope it will be efficient. I can't say it yet. It's nice that you can see how much mascara has lost. Putting is very easy, the mascara does not spill. I am only worried that you have to move it in a horizontal position, otherwise the ink may pour out. I am generally satisfied with the purchase.",
        "pros_en": [
            "pure ink filling",
            "volume of work"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "18299406",
        "author": "U...o",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Po 1 dniu uzytkowania mozna stwierdzic 1-polaczenie z kompem poprzez wi fi-bez problemu\n2-tankowanie zbiorniczkow-bez problemu\n3-montaz ,,glowic,,-beznadziejny dostep,jakies pomaranczowe badziewie ciezko wydostac z wnetrza drukarki(po cholere takie zabezpieczenie)ale udalo sie\n4-polaczenie z telefonem -bez problemu\n5-jak z kompa tak i z telefonu(za posrednictwem aplikacji  HP SMART) bez problemow\n6-druk na zwyklym papierze spoko (czern i kolor )\n7-po testach na papierze foto -zobaczymy\n8-ogolnie -za taka kase polecam",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "jakość wydruków",
            "jakość wydruku",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-12 21:03:08",
        "purchased": "2024-01-09 18:20:01",
        "content_en": "After 1 day of use\n2-tank tank-attempt\n3-Montaz ,, GLOWIC ,,-hopeless access, some orange crap is hard to get out of the printer's interior (damn such protection) but it went\n4 -Pole with the phone -a problem\n5-like from a computer yes and from the phone (through the HP Smart application) without problems\n6-Drust on ordinary paper cool (black and color)\n7 -work tests on photo paper -we will see\n8 -generalized -I recommend such money for such money",
        "pros_en": [
            "pure ink filling",
            "Print quality",
            "Print quality",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "15226709",
        "author": "k...l",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wszystko z opisu się zgadza. Baaardzo ekonomiczna, jakość druku wysoka, jak na czołg drukarkowy niewielka... Przypomniałem sobie tyko dlaczego nie lubię HP-ków. Mało intuicyjna aplikacja, nie tak denerwująca jak kiedyś ale konfiguracja trwała zbyt długo. A poza tym zupełnie spoko.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2021-11-18 17:47:41",
        "purchased": "2021-11-01 18:36:33",
        "content_en": "Everything in the description is correct. Very economical, the quality of the printing is high, like a small printer tank ... I remembered only why I don't like HP. A little intuitive application, not as annoying as it used to be but the configuration lasted too long. And besides, completely cool.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "11176459",
        "author": "Madziana",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Drukarka od samego początku jest bardzo przyjazna, pierwsze uruchomienie pomimo że na początku wygląda na dość skomplikowane po obejrzeniu szczegółowej instrukcji jest banalnie proste :) Konfiguracje i podłączenie do sieci wi fi trwało bardzo krótko i była wyjątkowo  łatwe :) Drukarka została skonfigurowana została na komputerze oraz smartfonie z androidem, zarówno na komputerze jak i na smarthonie aplikacja do sterowania drukarki jest bardzo przejrzysta i intuicyjna. Na pochwałę zasługuje  aplikacja dla androida która jest konfigurowalna  i można przystosować ją dla swoich potrzeb, jeśli chodzi o wydruk to można przyznać że, drukarka drukuje cicho, bardzo szybko a jakość wydruku zarówno w kolorze czarnym jak i w kolorze jest rewelacyjna :) kolory żywe, wyraziste, obrazki nierozmazane. Mogę oficjalnie przyznać że spełniła moje oczekiwania w wydruku jak i w wyglądzie :)",
        "pros_pl": [
            "jakość wydruków",
            "szybkość wydruku",
            "wydajność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 5,
        "published": "2019-10-19 23:50:49",
        "purchased": null,
        "content_en": "The printer from the very beginning is very friendly, the first start, despite the fact that at the beginning it looks quite complicated after seeing the detailed instructions is very easy :) Configurations and connection to the Wi Fi network took a very short and was extremely easy :) The printer was configured on the computer and Android smartphone, both on the computer and on the smarthon transparent and intuitive. The application for Android deserves praise which is configurable and can be adapted for your needs when it comes to printout, you can admit that the printer prints quietly, very quickly and the quality of the print in both black and color is sensational :) Vibrant colors, expressive, images not fried. I can officially admit that it has met my expectations in the print as well as in appearance :)",
        "pros_en": [
            "Print quality",
            "print speed",
            "efficiency"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "13501735",
        "author": "g...k",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "produkt na wstępie nie ruszył bo był problem z dyszami , po wymianie chodzi  OK , trochę długo i hałaśliwie  trwa proces włączania",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2020-12-04 00:11:48",
        "purchased": "2020-11-17 18:04:01",
        "content_en": "The product did not move at the beginning because there was a problem with the nozzles, after the replacement it walks ok, a little long and the process of switching on",
        "pros_en": [
            "Print quality",
            "Print quality",
            "print speed"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "14283834",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Bardzo wydajna i oszczędna drukarka. Solidna, dobra jakość wykonania.\nDługo się czeka przy włączeniu zanim będzie gotowa do pracy. Dość głośna.",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku"
        ],
        "cons_pl": [
            "głośność pracy",
            "szybkość wydruku"
        ],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2021-04-14 00:32:31",
        "purchased": "2021-03-23 08:31:21",
        "content_en": "Very efficient and economical printer. Solid, good quality.\nIt has been waiting for a long time when it is ready to work. Pretty loud.",
        "pros_en": [
            "Print quality",
            "Print quality"
        ],
        "cons_en": [
            "volume of work",
            "print speed"
        ]
    },
    {
        "opinion_id": "18283057",
        "author": "u...g",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "urządzenie przy pierwszym użytkowaniu wydaje się dobre. Problem z konfiguracją drukarki w systemie win7 na starszym urządzeniu.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-08 15:16:39",
        "purchased": "2023-12-18 13:21:12",
        "content_en": "The device at the first use seems good. Problem with the printer configuration in the Win7 system on an older device.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "13654028",
        "author": "p...m",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Drukarka jak na tą cenę jest bardzo słaba, Czas  potrzebny do wydrukowania pierwszej strony to prawie dwie minuty. A odgłosy wydaje takie, jakby za chwilę miała rozpaść się. W tej cenie należałoby też oczekiwać dwustronnego automatycznego wydruku. Wprawdzie info o dwustronnym wydruku jest na stronie sklepu, ale w rzeczywistości nie ma to nic wspólnego z dwustronnym wydrukiem, kartkę trzeba przenosić ręcznie zgodnie z wyświetlona instrukcją.",
        "pros_pl": [],
        "cons_pl": [
            "głośność pracy",
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "vote_yes": 6,
        "vote_no": 1,
        "published": "2020-12-26 21:42:32",
        "purchased": "2020-11-26 08:21:40",
        "content_en": "The printer is very weak for this price, the time needed to print the first page is almost two minutes. And the sounds seem as if it would fall apart in a moment. At this price you should also expect a double -sided automatic print. Although the info of a double -sided printout is on the store's website, but in fact it has nothing to do with a double -sided printout, the card must be transferred manually according to the displayed instructions.",
        "pros_en": [],
        "cons_en": [
            "volume of work",
            "Print quality",
            "Print quality",
            "print speed"
        ]
    },
    {
        "opinion_id": "13243464",
        "author": "m...i",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Niestety pierwsze wrazenie po uruchomieniu sprzetu negatywne. Odrazu trzeba bylo skladac reklamacje poniewaz jakosc druku odbiegała od normy. Po zgloszeniu okazalo sie ze jest uszkodzona glowica. Zobaczymy jak przyjdzie nowa glowica czy cos to da. Jaknarazie to wielka porażka a myslalam ze sprzet za ta cene bedzie działał bez zarzutu. Niestety pomyliłam się.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 8,
        "vote_no": 4,
        "published": "2020-10-20 18:00:33",
        "purchased": "2020-10-16 15:51:18",
        "content_en": "Unfortunately, the first impression after starting negative equipment. Immediately it was necessary to make complaints because the quality of print rang from the norm. After reporting, it turned out that the head was damaged. We'll see how the new head comes or something will do it. Yaknarazie is a great failure and I thought that the equipment for this price will work flawlessly. Unfortunately, I was wrong.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12535429",
        "author": "g...6",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Instalacja łatwa. Oprogramowanie HP Smart bezproblemowe. Zwrot 100zl Cashback z Promocji po kilku dniach od zakupu. Skanuje. Drukuje. \nPrzez pierwsze 2-3 dni wszystko w porządku, wydruki czarne i kolorowe bardzo dobre. Po 3 dniu, zupełnie nagle, drukarka zaczyna drukować białe poziome kreski na wydrukach kolorowych. W czarnym bardzo dobrze. Wydruki w najlepszej jakości są bardzo dobre. Wydruki w jakości normalnej i roboczej są moim zdaniem wadliwe. Kupiłem 2 drukarki. Jedną udało mi się zwrócić w ramach 14 zwrotu. Druga niestety została. \nProducent HP raz uznał gwarancję. HP przysłałi nową głowicę kolorową, a jak problem nie został rozwiązany, całą nową drukarkę. Trzecia drukarka tak samo, drukuje białe kreski na wydrukach kolorowych. \nZgłoszone ponownie do HP, tym razem w ocenie wsparcia HP, drukarki atramentowe tak drukują... Pozostawię to bez komentarza. Chciałem zgłosić w ramach rękojmi, niezgodność produktu z umową (reklamują outstanding printing quality), ale niestety kupiłem na firmę i rękojmia jest wyłączona. Nie wiem czy wadliwa seria drukarek, głowic, oprogramowania czy może ja coś źle robię przy 1-szym uruchamianiu, ale HP nie chce poznać i rozwiązać problemu. Dobre jest to, że po kilku dniach, pierwsze strony wydruków wychodzą ok, a kreski pojawiają się dopiero na 3-4 stronie. Może z czasem się to poprawi samo, jeśli problemem jest zapowietrzenie głowicy lub aktualizacja oprogramowania sprzętowego... \nCo ciekawe, HP nie wymaga odciągania tuszy strzykawką do wysyłki drukarki a sklep tak. Drugi raz bym nie kupił, chyba że sprawdzoną przetestowaną.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "jakość wydruków"
        ],
        "vote_yes": 19,
        "vote_no": 3,
        "published": "2020-05-28 08:02:51",
        "purchased": "2020-05-04 22:29:44",
        "content_en": "Easy installation. HP Smart software trouble -free. Return of PLN 100 Cashback from the promotion a few days after purchase. Scans. Prints. \nFor the first 2-3 days everything is fine, black and colorful prints very good. After the 3rd day, quite suddenly, the printer begins to print white horizontal lines on colored prints. Very good in Czarny. Printouts in the best quality are very good. Prints in normal and working quality are in my opinion defective. I bought 2 printers. I managed to return one as part of the 14 return. The second unfortunately stayed. \nThe HP manufacturer once recognized the warranty. HP has sent a new colored head, and as the problem was not solved, the whole new printer. The third printer is the same, prints white lines on colored prints. \nReported to HP again, this time in the HP support assessment, inkjet printers print this way ... I will leave it without comment. I wanted to report as part of the warranty, the product's incompatibility with the contract (they advertise the Outstanding Printing Quality), but unfortunately I bought the company and the warranty is turned off. I do not know if a defective series of printers, heads, software or maybe I do something wrong with the 1st start, but HP does not want to know and solve the problem. It is good that after a few days, the first pages of the printout come out ok, and the lines appear only on the 3-4 page. Maybe over time it will improve by itself, if the problem is to announce the head or update the hardware software ... \nInterestingly, HP does not require pulling the carcass with a syringe for shipping the printer and the store yes. I wouldn't buy a second time, unless tested.",
        "pros_en": [
            "pure ink filling",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "Print quality"
        ]
    },
    {
        "opinion_id": "13551598",
        "author": "b...a",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wykonana dobrze, trochę za duża, z ledwością mieści mi się na biurku, ale może być. Drukuje ciszej w porównaniu z poprzednią drukarką HP 209a. Napełniłam tusze do pełna i po ok.10 kartkach ubyło mi 4 mm czarnego tuszu w pojemniku. Mam nadzieję, że będzie wydajna. Na razie nie mogę tego stwierdzić. Fajnie, że można zobaczyć, ile ubyło tuszu. Dolewanie jest banalnie proste, tusz nie wylewa się. Martwi mnie tylko, że przenosić trzeba ją w pozycji poziomej, bo inaczej tusz może się wylewać. Ogólnie jestem zadowolona z zakupu.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "głośność pracy"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 3,
        "published": "2020-12-10 19:41:04",
        "purchased": "2020-12-04 21:02:01",
        "content_en": "Made well, a bit too big, it barely fits on my desk, but it can be. Prints quieter compared to the previous HP 209A printer. I filled the inks to full and after about 10 cards I lost 4 mm black mascara in the container. I hope it will be efficient. I can't say it yet. It's nice that you can see how much mascara has lost. Putting is very easy, the mascara does not spill. I am only worried that you have to move it in a horizontal position, otherwise the ink may pour out. I am generally satisfied with the purchase.",
        "pros_en": [
            "pure ink filling",
            "volume of work"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "18299406",
        "author": "U...o",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Po 1 dniu uzytkowania mozna stwierdzic 1-polaczenie z kompem poprzez wi fi-bez problemu\n2-tankowanie zbiorniczkow-bez problemu\n3-montaz ,,glowic,,-beznadziejny dostep,jakies pomaranczowe badziewie ciezko wydostac z wnetrza drukarki(po cholere takie zabezpieczenie)ale udalo sie\n4-polaczenie z telefonem -bez problemu\n5-jak z kompa tak i z telefonu(za posrednictwem aplikacji  HP SMART) bez problemow\n6-druk na zwyklym papierze spoko (czern i kolor )\n7-po testach na papierze foto -zobaczymy\n8-ogolnie -za taka kase polecam",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "jakość wydruków",
            "jakość wydruku",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-12 21:03:08",
        "purchased": "2024-01-09 18:20:01",
        "content_en": "After 1 day of use\n2-tank tank-attempt\n3-Montaz ,, GLOWIC ,,-hopeless access, some orange crap is hard to get out of the printer's interior (damn such protection) but it went\n4 -Pole with the phone -a problem\n5-like from a computer yes and from the phone (through the HP Smart application) without problems\n6-Drust on ordinary paper cool (black and color)\n7 -work tests on photo paper -we will see\n8 -generalized -I recommend such money for such money",
        "pros_en": [
            "pure ink filling",
            "Print quality",
            "Print quality",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "15226709",
        "author": "k...l",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wszystko z opisu się zgadza. Baaardzo ekonomiczna, jakość druku wysoka, jak na czołg drukarkowy niewielka... Przypomniałem sobie tyko dlaczego nie lubię HP-ków. Mało intuicyjna aplikacja, nie tak denerwująca jak kiedyś ale konfiguracja trwała zbyt długo. A poza tym zupełnie spoko.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2021-11-18 17:47:41",
        "purchased": "2021-11-01 18:36:33",
        "content_en": "Everything in the description is correct. Very economical, the quality of the printing is high, like a small printer tank ... I remembered only why I don't like HP. A little intuitive application, not as annoying as it used to be but the configuration lasted too long. And besides, completely cool.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "11176459",
        "author": "Madziana",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Drukarka od samego początku jest bardzo przyjazna, pierwsze uruchomienie pomimo że na początku wygląda na dość skomplikowane po obejrzeniu szczegółowej instrukcji jest banalnie proste :) Konfiguracje i podłączenie do sieci wi fi trwało bardzo krótko i była wyjątkowo  łatwe :) Drukarka została skonfigurowana została na komputerze oraz smartfonie z androidem, zarówno na komputerze jak i na smarthonie aplikacja do sterowania drukarki jest bardzo przejrzysta i intuicyjna. Na pochwałę zasługuje  aplikacja dla androida która jest konfigurowalna  i można przystosować ją dla swoich potrzeb, jeśli chodzi o wydruk to można przyznać że, drukarka drukuje cicho, bardzo szybko a jakość wydruku zarówno w kolorze czarnym jak i w kolorze jest rewelacyjna :) kolory żywe, wyraziste, obrazki nierozmazane. Mogę oficjalnie przyznać że spełniła moje oczekiwania w wydruku jak i w wyglądzie :)",
        "pros_pl": [
            "jakość wydruków",
            "szybkość wydruku",
            "wydajność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 5,
        "published": "2019-10-19 23:50:49",
        "purchased": null,
        "content_en": "The printer from the very beginning is very friendly, the first start, despite the fact that at the beginning it looks quite complicated after seeing the detailed instructions is very easy :) Configurations and connection to the Wi Fi network took a very short and was extremely easy :) The printer was configured on the computer and Android smartphone, both on the computer and on the smarthon transparent and intuitive. The application for Android deserves praise which is configurable and can be adapted for your needs when it comes to printout, you can admit that the printer prints quietly, very quickly and the quality of the print in both black and color is sensational :) Vibrant colors, expressive, images not fried. I can officially admit that it has met my expectations in the print as well as in appearance :)",
        "pros_en": [
            "Print quality",
            "print speed",
            "efficiency"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "13501735",
        "author": "g...k",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "produkt na wstępie nie ruszył bo był problem z dyszami , po wymianie chodzi  OK , trochę długo i hałaśliwie  trwa proces włączania",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2020-12-04 00:11:48",
        "purchased": "2020-11-17 18:04:01",
        "content_en": "The product did not move at the beginning because there was a problem with the nozzles, after the replacement it walks ok, a little long and the process of switching on",
        "pros_en": [
            "Print quality",
            "Print quality",
            "print speed"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "14283834",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Bardzo wydajna i oszczędna drukarka. Solidna, dobra jakość wykonania.\nDługo się czeka przy włączeniu zanim będzie gotowa do pracy. Dość głośna.",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku"
        ],
        "cons_pl": [
            "głośność pracy",
            "szybkość wydruku"
        ],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2021-04-14 00:32:31",
        "purchased": "2021-03-23 08:31:21",
        "content_en": "Very efficient and economical printer. Solid, good quality.\nIt has been waiting for a long time when it is ready to work. Pretty loud.",
        "pros_en": [
            "Print quality",
            "Print quality"
        ],
        "cons_en": [
            "volume of work",
            "print speed"
        ]
    },
    {
        "opinion_id": "18283057",
        "author": "u...g",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "urządzenie przy pierwszym użytkowaniu wydaje się dobre. Problem z konfiguracją drukarki w systemie win7 na starszym urządzeniu.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-08 15:16:39",
        "purchased": "2023-12-18 13:21:12",
        "content_en": "The device at the first use seems good. Problem with the printer configuration in the Win7 system on an older device.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "13654028",
        "author": "p...m",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Drukarka jak na tą cenę jest bardzo słaba, Czas  potrzebny do wydrukowania pierwszej strony to prawie dwie minuty. A odgłosy wydaje takie, jakby za chwilę miała rozpaść się. W tej cenie należałoby też oczekiwać dwustronnego automatycznego wydruku. Wprawdzie info o dwustronnym wydruku jest na stronie sklepu, ale w rzeczywistości nie ma to nic wspólnego z dwustronnym wydrukiem, kartkę trzeba przenosić ręcznie zgodnie z wyświetlona instrukcją.",
        "pros_pl": [],
        "cons_pl": [
            "głośność pracy",
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "vote_yes": 6,
        "vote_no": 1,
        "published": "2020-12-26 21:42:32",
        "purchased": "2020-11-26 08:21:40",
        "content_en": "The printer is very weak for this price, the time needed to print the first page is almost two minutes. And the sounds seem as if it would fall apart in a moment. At this price you should also expect a double -sided automatic print. Although the info of a double -sided printout is on the store's website, but in fact it has nothing to do with a double -sided printout, the card must be transferred manually according to the displayed instructions.",
        "pros_en": [],
        "cons_en": [
            "volume of work",
            "Print quality",
            "Print quality",
            "print speed"
        ]
    },
    {
        "opinion_id": "13243464",
        "author": "m...i",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Niestety pierwsze wrazenie po uruchomieniu sprzetu negatywne. Odrazu trzeba bylo skladac reklamacje poniewaz jakosc druku odbiegała od normy. Po zgloszeniu okazalo sie ze jest uszkodzona glowica. Zobaczymy jak przyjdzie nowa glowica czy cos to da. Jaknarazie to wielka porażka a myslalam ze sprzet za ta cene bedzie działał bez zarzutu. Niestety pomyliłam się.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 8,
        "vote_no": 4,
        "published": "2020-10-20 18:00:33",
        "purchased": "2020-10-16 15:51:18",
        "content_en": "Unfortunately, the first impression after starting negative equipment. Immediately it was necessary to make complaints because the quality of print rang from the norm. After reporting, it turned out that the head was damaged. We'll see how the new head comes or something will do it. Yaknarazie is a great failure and I thought that the equipment for this price will work flawlessly. Unfortunately, I was wrong.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12535429",
        "author": "g...6",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Instalacja łatwa. Oprogramowanie HP Smart bezproblemowe. Zwrot 100zl Cashback z Promocji po kilku dniach od zakupu. Skanuje. Drukuje. \nPrzez pierwsze 2-3 dni wszystko w porządku, wydruki czarne i kolorowe bardzo dobre. Po 3 dniu, zupełnie nagle, drukarka zaczyna drukować białe poziome kreski na wydrukach kolorowych. W czarnym bardzo dobrze. Wydruki w najlepszej jakości są bardzo dobre. Wydruki w jakości normalnej i roboczej są moim zdaniem wadliwe. Kupiłem 2 drukarki. Jedną udało mi się zwrócić w ramach 14 zwrotu. Druga niestety została. \nProducent HP raz uznał gwarancję. HP przysłałi nową głowicę kolorową, a jak problem nie został rozwiązany, całą nową drukarkę. Trzecia drukarka tak samo, drukuje białe kreski na wydrukach kolorowych. \nZgłoszone ponownie do HP, tym razem w ocenie wsparcia HP, drukarki atramentowe tak drukują... Pozostawię to bez komentarza. Chciałem zgłosić w ramach rękojmi, niezgodność produktu z umową (reklamują outstanding printing quality), ale niestety kupiłem na firmę i rękojmia jest wyłączona. Nie wiem czy wadliwa seria drukarek, głowic, oprogramowania czy może ja coś źle robię przy 1-szym uruchamianiu, ale HP nie chce poznać i rozwiązać problemu. Dobre jest to, że po kilku dniach, pierwsze strony wydruków wychodzą ok, a kreski pojawiają się dopiero na 3-4 stronie. Może z czasem się to poprawi samo, jeśli problemem jest zapowietrzenie głowicy lub aktualizacja oprogramowania sprzętowego... \nCo ciekawe, HP nie wymaga odciągania tuszy strzykawką do wysyłki drukarki a sklep tak. Drugi raz bym nie kupił, chyba że sprawdzoną przetestowaną.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "jakość wydruków"
        ],
        "vote_yes": 19,
        "vote_no": 3,
        "published": "2020-05-28 08:02:51",
        "purchased": "2020-05-04 22:29:44",
        "content_en": "Easy installation. HP Smart software trouble -free. Return of PLN 100 Cashback from the promotion a few days after purchase. Scans. Prints. \nFor the first 2-3 days everything is fine, black and colorful prints very good. After the 3rd day, quite suddenly, the printer begins to print white horizontal lines on colored prints. Very good in Czarny. Printouts in the best quality are very good. Prints in normal and working quality are in my opinion defective. I bought 2 printers. I managed to return one as part of the 14 return. The second unfortunately stayed. \nThe HP manufacturer once recognized the warranty. HP has sent a new colored head, and as the problem was not solved, the whole new printer. The third printer is the same, prints white lines on colored prints. \nReported to HP again, this time in the HP support assessment, inkjet printers print this way ... I will leave it without comment. I wanted to report as part of the warranty, the product's incompatibility with the contract (they advertise the Outstanding Printing Quality), but unfortunately I bought the company and the warranty is turned off. I do not know if a defective series of printers, heads, software or maybe I do something wrong with the 1st start, but HP does not want to know and solve the problem. It is good that after a few days, the first pages of the printout come out ok, and the lines appear only on the 3-4 page. Maybe over time it will improve by itself, if the problem is to announce the head or update the hardware software ... \nInterestingly, HP does not require pulling the carcass with a syringe for shipping the printer and the store yes. I wouldn't buy a second time, unless tested.",
        "pros_en": [
            "pure ink filling",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "Print quality"
        ]
    },
    {
        "opinion_id": "13551598",
        "author": "b...a",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wykonana dobrze, trochę za duża, z ledwością mieści mi się na biurku, ale może być. Drukuje ciszej w porównaniu z poprzednią drukarką HP 209a. Napełniłam tusze do pełna i po ok.10 kartkach ubyło mi 4 mm czarnego tuszu w pojemniku. Mam nadzieję, że będzie wydajna. Na razie nie mogę tego stwierdzić. Fajnie, że można zobaczyć, ile ubyło tuszu. Dolewanie jest banalnie proste, tusz nie wylewa się. Martwi mnie tylko, że przenosić trzeba ją w pozycji poziomej, bo inaczej tusz może się wylewać. Ogólnie jestem zadowolona z zakupu.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "głośność pracy"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 3,
        "published": "2020-12-10 19:41:04",
        "purchased": "2020-12-04 21:02:01",
        "content_en": "Made well, a bit too big, it barely fits on my desk, but it can be. Prints quieter compared to the previous HP 209A printer. I filled the inks to full and after about 10 cards I lost 4 mm black mascara in the container. I hope it will be efficient. I can't say it yet. It's nice that you can see how much mascara has lost. Putting is very easy, the mascara does not spill. I am only worried that you have to move it in a horizontal position, otherwise the ink may pour out. I am generally satisfied with the purchase.",
        "pros_en": [
            "pure ink filling",
            "volume of work"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "18299406",
        "author": "U...o",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Po 1 dniu uzytkowania mozna stwierdzic 1-polaczenie z kompem poprzez wi fi-bez problemu\n2-tankowanie zbiorniczkow-bez problemu\n3-montaz ,,glowic,,-beznadziejny dostep,jakies pomaranczowe badziewie ciezko wydostac z wnetrza drukarki(po cholere takie zabezpieczenie)ale udalo sie\n4-polaczenie z telefonem -bez problemu\n5-jak z kompa tak i z telefonu(za posrednictwem aplikacji  HP SMART) bez problemow\n6-druk na zwyklym papierze spoko (czern i kolor )\n7-po testach na papierze foto -zobaczymy\n8-ogolnie -za taka kase polecam",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "jakość wydruków",
            "jakość wydruku",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-12 21:03:08",
        "purchased": "2024-01-09 18:20:01",
        "content_en": "After 1 day of use\n2-tank tank-attempt\n3-Montaz ,, GLOWIC ,,-hopeless access, some orange crap is hard to get out of the printer's interior (damn such protection) but it went\n4 -Pole with the phone -a problem\n5-like from a computer yes and from the phone (through the HP Smart application) without problems\n6-Drust on ordinary paper cool (black and color)\n7 -work tests on photo paper -we will see\n8 -generalized -I recommend such money for such money",
        "pros_en": [
            "pure ink filling",
            "Print quality",
            "Print quality",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "15226709",
        "author": "k...l",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wszystko z opisu się zgadza. Baaardzo ekonomiczna, jakość druku wysoka, jak na czołg drukarkowy niewielka... Przypomniałem sobie tyko dlaczego nie lubię HP-ków. Mało intuicyjna aplikacja, nie tak denerwująca jak kiedyś ale konfiguracja trwała zbyt długo. A poza tym zupełnie spoko.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2021-11-18 17:47:41",
        "purchased": "2021-11-01 18:36:33",
        "content_en": "Everything in the description is correct. Very economical, the quality of the printing is high, like a small printer tank ... I remembered only why I don't like HP. A little intuitive application, not as annoying as it used to be but the configuration lasted too long. And besides, completely cool.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "11176459",
        "author": "Madziana",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Drukarka od samego początku jest bardzo przyjazna, pierwsze uruchomienie pomimo że na początku wygląda na dość skomplikowane po obejrzeniu szczegółowej instrukcji jest banalnie proste :) Konfiguracje i podłączenie do sieci wi fi trwało bardzo krótko i była wyjątkowo  łatwe :) Drukarka została skonfigurowana została na komputerze oraz smartfonie z androidem, zarówno na komputerze jak i na smarthonie aplikacja do sterowania drukarki jest bardzo przejrzysta i intuicyjna. Na pochwałę zasługuje  aplikacja dla androida która jest konfigurowalna  i można przystosować ją dla swoich potrzeb, jeśli chodzi o wydruk to można przyznać że, drukarka drukuje cicho, bardzo szybko a jakość wydruku zarówno w kolorze czarnym jak i w kolorze jest rewelacyjna :) kolory żywe, wyraziste, obrazki nierozmazane. Mogę oficjalnie przyznać że spełniła moje oczekiwania w wydruku jak i w wyglądzie :)",
        "pros_pl": [
            "jakość wydruków",
            "szybkość wydruku",
            "wydajność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 5,
        "published": "2019-10-19 23:50:49",
        "purchased": null,
        "content_en": "The printer from the very beginning is very friendly, the first start, despite the fact that at the beginning it looks quite complicated after seeing the detailed instructions is very easy :) Configurations and connection to the Wi Fi network took a very short and was extremely easy :) The printer was configured on the computer and Android smartphone, both on the computer and on the smarthon transparent and intuitive. The application for Android deserves praise which is configurable and can be adapted for your needs when it comes to printout, you can admit that the printer prints quietly, very quickly and the quality of the print in both black and color is sensational :) Vibrant colors, expressive, images not fried. I can officially admit that it has met my expectations in the print as well as in appearance :)",
        "pros_en": [
            "Print quality",
            "print speed",
            "efficiency"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "13501735",
        "author": "g...k",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "produkt na wstępie nie ruszył bo był problem z dyszami , po wymianie chodzi  OK , trochę długo i hałaśliwie  trwa proces włączania",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2020-12-04 00:11:48",
        "purchased": "2020-11-17 18:04:01",
        "content_en": "The product did not move at the beginning because there was a problem with the nozzles, after the replacement it walks ok, a little long and the process of switching on",
        "pros_en": [
            "Print quality",
            "Print quality",
            "print speed"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "14283834",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Bardzo wydajna i oszczędna drukarka. Solidna, dobra jakość wykonania.\nDługo się czeka przy włączeniu zanim będzie gotowa do pracy. Dość głośna.",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku"
        ],
        "cons_pl": [
            "głośność pracy",
            "szybkość wydruku"
        ],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2021-04-14 00:32:31",
        "purchased": "2021-03-23 08:31:21",
        "content_en": "Very efficient and economical printer. Solid, good quality.\nIt has been waiting for a long time when it is ready to work. Pretty loud.",
        "pros_en": [
            "Print quality",
            "Print quality"
        ],
        "cons_en": [
            "volume of work",
            "print speed"
        ]
    },
    {
        "opinion_id": "18283057",
        "author": "u...g",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "urządzenie przy pierwszym użytkowaniu wydaje się dobre. Problem z konfiguracją drukarki w systemie win7 na starszym urządzeniu.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-08 15:16:39",
        "purchased": "2023-12-18 13:21:12",
        "content_en": "The device at the first use seems good. Problem with the printer configuration in the Win7 system on an older device.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "13654028",
        "author": "p...m",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Drukarka jak na tą cenę jest bardzo słaba, Czas  potrzebny do wydrukowania pierwszej strony to prawie dwie minuty. A odgłosy wydaje takie, jakby za chwilę miała rozpaść się. W tej cenie należałoby też oczekiwać dwustronnego automatycznego wydruku. Wprawdzie info o dwustronnym wydruku jest na stronie sklepu, ale w rzeczywistości nie ma to nic wspólnego z dwustronnym wydrukiem, kartkę trzeba przenosić ręcznie zgodnie z wyświetlona instrukcją.",
        "pros_pl": [],
        "cons_pl": [
            "głośność pracy",
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "vote_yes": 6,
        "vote_no": 1,
        "published": "2020-12-26 21:42:32",
        "purchased": "2020-11-26 08:21:40",
        "content_en": "The printer is very weak for this price, the time needed to print the first page is almost two minutes. And the sounds seem as if it would fall apart in a moment. At this price you should also expect a double -sided automatic print. Although the info of a double -sided printout is on the store's website, but in fact it has nothing to do with a double -sided printout, the card must be transferred manually according to the displayed instructions.",
        "pros_en": [],
        "cons_en": [
            "volume of work",
            "Print quality",
            "Print quality",
            "print speed"
        ]
    },
    {
        "opinion_id": "13243464",
        "author": "m...i",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Niestety pierwsze wrazenie po uruchomieniu sprzetu negatywne. Odrazu trzeba bylo skladac reklamacje poniewaz jakosc druku odbiegała od normy. Po zgloszeniu okazalo sie ze jest uszkodzona glowica. Zobaczymy jak przyjdzie nowa glowica czy cos to da. Jaknarazie to wielka porażka a myslalam ze sprzet za ta cene bedzie działał bez zarzutu. Niestety pomyliłam się.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 8,
        "vote_no": 4,
        "published": "2020-10-20 18:00:33",
        "purchased": "2020-10-16 15:51:18",
        "content_en": "Unfortunately, the first impression after starting negative equipment. Immediately it was necessary to make complaints because the quality of print rang from the norm. After reporting, it turned out that the head was damaged. We'll see how the new head comes or something will do it. Yaknarazie is a great failure and I thought that the equipment for this price will work flawlessly. Unfortunately, I was wrong.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12535429",
        "author": "g...6",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Instalacja łatwa. Oprogramowanie HP Smart bezproblemowe. Zwrot 100zl Cashback z Promocji po kilku dniach od zakupu. Skanuje. Drukuje. \nPrzez pierwsze 2-3 dni wszystko w porządku, wydruki czarne i kolorowe bardzo dobre. Po 3 dniu, zupełnie nagle, drukarka zaczyna drukować białe poziome kreski na wydrukach kolorowych. W czarnym bardzo dobrze. Wydruki w najlepszej jakości są bardzo dobre. Wydruki w jakości normalnej i roboczej są moim zdaniem wadliwe. Kupiłem 2 drukarki. Jedną udało mi się zwrócić w ramach 14 zwrotu. Druga niestety została. \nProducent HP raz uznał gwarancję. HP przysłałi nową głowicę kolorową, a jak problem nie został rozwiązany, całą nową drukarkę. Trzecia drukarka tak samo, drukuje białe kreski na wydrukach kolorowych. \nZgłoszone ponownie do HP, tym razem w ocenie wsparcia HP, drukarki atramentowe tak drukują... Pozostawię to bez komentarza. Chciałem zgłosić w ramach rękojmi, niezgodność produktu z umową (reklamują outstanding printing quality), ale niestety kupiłem na firmę i rękojmia jest wyłączona. Nie wiem czy wadliwa seria drukarek, głowic, oprogramowania czy może ja coś źle robię przy 1-szym uruchamianiu, ale HP nie chce poznać i rozwiązać problemu. Dobre jest to, że po kilku dniach, pierwsze strony wydruków wychodzą ok, a kreski pojawiają się dopiero na 3-4 stronie. Może z czasem się to poprawi samo, jeśli problemem jest zapowietrzenie głowicy lub aktualizacja oprogramowania sprzętowego... \nCo ciekawe, HP nie wymaga odciągania tuszy strzykawką do wysyłki drukarki a sklep tak. Drugi raz bym nie kupił, chyba że sprawdzoną przetestowaną.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "jakość wydruków"
        ],
        "vote_yes": 19,
        "vote_no": 3,
        "published": "2020-05-28 08:02:51",
        "purchased": "2020-05-04 22:29:44",
        "content_en": "Easy installation. HP Smart software trouble -free. Return of PLN 100 Cashback from the promotion a few days after purchase. Scans. Prints. \nFor the first 2-3 days everything is fine, black and colorful prints very good. After the 3rd day, quite suddenly, the printer begins to print white horizontal lines on colored prints. Very good in Czarny. Printouts in the best quality are very good. Prints in normal and working quality are in my opinion defective. I bought 2 printers. I managed to return one as part of the 14 return. The second unfortunately stayed. \nThe HP manufacturer once recognized the warranty. HP has sent a new colored head, and as the problem was not solved, the whole new printer. The third printer is the same, prints white lines on colored prints. \nReported to HP again, this time in the HP support assessment, inkjet printers print this way ... I will leave it without comment. I wanted to report as part of the warranty, the product's incompatibility with the contract (they advertise the Outstanding Printing Quality), but unfortunately I bought the company and the warranty is turned off. I do not know if a defective series of printers, heads, software or maybe I do something wrong with the 1st start, but HP does not want to know and solve the problem. It is good that after a few days, the first pages of the printout come out ok, and the lines appear only on the 3-4 page. Maybe over time it will improve by itself, if the problem is to announce the head or update the hardware software ... \nInterestingly, HP does not require pulling the carcass with a syringe for shipping the printer and the store yes. I wouldn't buy a second time, unless tested.",
        "pros_en": [
            "pure ink filling",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "Print quality"
        ]
    },
    {
        "opinion_id": "13551598",
        "author": "b...a",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wykonana dobrze, trochę za duża, z ledwością mieści mi się na biurku, ale może być. Drukuje ciszej w porównaniu z poprzednią drukarką HP 209a. Napełniłam tusze do pełna i po ok.10 kartkach ubyło mi 4 mm czarnego tuszu w pojemniku. Mam nadzieję, że będzie wydajna. Na razie nie mogę tego stwierdzić. Fajnie, że można zobaczyć, ile ubyło tuszu. Dolewanie jest banalnie proste, tusz nie wylewa się. Martwi mnie tylko, że przenosić trzeba ją w pozycji poziomej, bo inaczej tusz może się wylewać. Ogólnie jestem zadowolona z zakupu.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "głośność pracy"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 3,
        "published": "2020-12-10 19:41:04",
        "purchased": "2020-12-04 21:02:01",
        "content_en": "Made well, a bit too big, it barely fits on my desk, but it can be. Prints quieter compared to the previous HP 209A printer. I filled the inks to full and after about 10 cards I lost 4 mm black mascara in the container. I hope it will be efficient. I can't say it yet. It's nice that you can see how much mascara has lost. Putting is very easy, the mascara does not spill. I am only worried that you have to move it in a horizontal position, otherwise the ink may pour out. I am generally satisfied with the purchase.",
        "pros_en": [
            "pure ink filling",
            "volume of work"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "18299406",
        "author": "U...o",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Po 1 dniu uzytkowania mozna stwierdzic 1-polaczenie z kompem poprzez wi fi-bez problemu\n2-tankowanie zbiorniczkow-bez problemu\n3-montaz ,,glowic,,-beznadziejny dostep,jakies pomaranczowe badziewie ciezko wydostac z wnetrza drukarki(po cholere takie zabezpieczenie)ale udalo sie\n4-polaczenie z telefonem -bez problemu\n5-jak z kompa tak i z telefonu(za posrednictwem aplikacji  HP SMART) bez problemow\n6-druk na zwyklym papierze spoko (czern i kolor )\n7-po testach na papierze foto -zobaczymy\n8-ogolnie -za taka kase polecam",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "jakość wydruków",
            "jakość wydruku",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-12 21:03:08",
        "purchased": "2024-01-09 18:20:01",
        "content_en": "After 1 day of use\n2-tank tank-attempt\n3-Montaz ,, GLOWIC ,,-hopeless access, some orange crap is hard to get out of the printer's interior (damn such protection) but it went\n4 -Pole with the phone -a problem\n5-like from a computer yes and from the phone (through the HP Smart application) without problems\n6-Drust on ordinary paper cool (black and color)\n7 -work tests on photo paper -we will see\n8 -generalized -I recommend such money for such money",
        "pros_en": [
            "pure ink filling",
            "Print quality",
            "Print quality",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "15226709",
        "author": "k...l",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wszystko z opisu się zgadza. Baaardzo ekonomiczna, jakość druku wysoka, jak na czołg drukarkowy niewielka... Przypomniałem sobie tyko dlaczego nie lubię HP-ków. Mało intuicyjna aplikacja, nie tak denerwująca jak kiedyś ale konfiguracja trwała zbyt długo. A poza tym zupełnie spoko.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2021-11-18 17:47:41",
        "purchased": "2021-11-01 18:36:33",
        "content_en": "Everything in the description is correct. Very economical, the quality of the printing is high, like a small printer tank ... I remembered only why I don't like HP. A little intuitive application, not as annoying as it used to be but the configuration lasted too long. And besides, completely cool.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "11176459",
        "author": "Madziana",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Drukarka od samego początku jest bardzo przyjazna, pierwsze uruchomienie pomimo że na początku wygląda na dość skomplikowane po obejrzeniu szczegółowej instrukcji jest banalnie proste :) Konfiguracje i podłączenie do sieci wi fi trwało bardzo krótko i była wyjątkowo  łatwe :) Drukarka została skonfigurowana została na komputerze oraz smartfonie z androidem, zarówno na komputerze jak i na smarthonie aplikacja do sterowania drukarki jest bardzo przejrzysta i intuicyjna. Na pochwałę zasługuje  aplikacja dla androida która jest konfigurowalna  i można przystosować ją dla swoich potrzeb, jeśli chodzi o wydruk to można przyznać że, drukarka drukuje cicho, bardzo szybko a jakość wydruku zarówno w kolorze czarnym jak i w kolorze jest rewelacyjna :) kolory żywe, wyraziste, obrazki nierozmazane. Mogę oficjalnie przyznać że spełniła moje oczekiwania w wydruku jak i w wyglądzie :)",
        "pros_pl": [
            "jakość wydruków",
            "szybkość wydruku",
            "wydajność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 5,
        "published": "2019-10-19 23:50:49",
        "purchased": null,
        "content_en": "The printer from the very beginning is very friendly, the first start, despite the fact that at the beginning it looks quite complicated after seeing the detailed instructions is very easy :) Configurations and connection to the Wi Fi network took a very short and was extremely easy :) The printer was configured on the computer and Android smartphone, both on the computer and on the smarthon transparent and intuitive. The application for Android deserves praise which is configurable and can be adapted for your needs when it comes to printout, you can admit that the printer prints quietly, very quickly and the quality of the print in both black and color is sensational :) Vibrant colors, expressive, images not fried. I can officially admit that it has met my expectations in the print as well as in appearance :)",
        "pros_en": [
            "Print quality",
            "print speed",
            "efficiency"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "13501735",
        "author": "g...k",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "produkt na wstępie nie ruszył bo był problem z dyszami , po wymianie chodzi  OK , trochę długo i hałaśliwie  trwa proces włączania",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2020-12-04 00:11:48",
        "purchased": "2020-11-17 18:04:01",
        "content_en": "The product did not move at the beginning because there was a problem with the nozzles, after the replacement it walks ok, a little long and the process of switching on",
        "pros_en": [
            "Print quality",
            "Print quality",
            "print speed"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "14283834",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Bardzo wydajna i oszczędna drukarka. Solidna, dobra jakość wykonania.\nDługo się czeka przy włączeniu zanim będzie gotowa do pracy. Dość głośna.",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku"
        ],
        "cons_pl": [
            "głośność pracy",
            "szybkość wydruku"
        ],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2021-04-14 00:32:31",
        "purchased": "2021-03-23 08:31:21",
        "content_en": "Very efficient and economical printer. Solid, good quality.\nIt has been waiting for a long time when it is ready to work. Pretty loud.",
        "pros_en": [
            "Print quality",
            "Print quality"
        ],
        "cons_en": [
            "volume of work",
            "print speed"
        ]
    },
    {
        "opinion_id": "18283057",
        "author": "u...g",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "urządzenie przy pierwszym użytkowaniu wydaje się dobre. Problem z konfiguracją drukarki w systemie win7 na starszym urządzeniu.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-08 15:16:39",
        "purchased": "2023-12-18 13:21:12",
        "content_en": "The device at the first use seems good. Problem with the printer configuration in the Win7 system on an older device.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "13654028",
        "author": "p...m",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Drukarka jak na tą cenę jest bardzo słaba, Czas  potrzebny do wydrukowania pierwszej strony to prawie dwie minuty. A odgłosy wydaje takie, jakby za chwilę miała rozpaść się. W tej cenie należałoby też oczekiwać dwustronnego automatycznego wydruku. Wprawdzie info o dwustronnym wydruku jest na stronie sklepu, ale w rzeczywistości nie ma to nic wspólnego z dwustronnym wydrukiem, kartkę trzeba przenosić ręcznie zgodnie z wyświetlona instrukcją.",
        "pros_pl": [],
        "cons_pl": [
            "głośność pracy",
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "vote_yes": 6,
        "vote_no": 1,
        "published": "2020-12-26 21:42:32",
        "purchased": "2020-11-26 08:21:40",
        "content_en": "The printer is very weak for this price, the time needed to print the first page is almost two minutes. And the sounds seem as if it would fall apart in a moment. At this price you should also expect a double -sided automatic print. Although the info of a double -sided printout is on the store's website, but in fact it has nothing to do with a double -sided printout, the card must be transferred manually according to the displayed instructions.",
        "pros_en": [],
        "cons_en": [
            "volume of work",
            "Print quality",
            "Print quality",
            "print speed"
        ]
    },
    {
        "opinion_id": "13243464",
        "author": "m...i",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Niestety pierwsze wrazenie po uruchomieniu sprzetu negatywne. Odrazu trzeba bylo skladac reklamacje poniewaz jakosc druku odbiegała od normy. Po zgloszeniu okazalo sie ze jest uszkodzona glowica. Zobaczymy jak przyjdzie nowa glowica czy cos to da. Jaknarazie to wielka porażka a myslalam ze sprzet za ta cene bedzie działał bez zarzutu. Niestety pomyliłam się.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 8,
        "vote_no": 4,
        "published": "2020-10-20 18:00:33",
        "purchased": "2020-10-16 15:51:18",
        "content_en": "Unfortunately, the first impression after starting negative equipment. Immediately it was necessary to make complaints because the quality of print rang from the norm. After reporting, it turned out that the head was damaged. We'll see how the new head comes or something will do it. Yaknarazie is a great failure and I thought that the equipment for this price will work flawlessly. Unfortunately, I was wrong.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12535429",
        "author": "g...6",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Instalacja łatwa. Oprogramowanie HP Smart bezproblemowe. Zwrot 100zl Cashback z Promocji po kilku dniach od zakupu. Skanuje. Drukuje. \nPrzez pierwsze 2-3 dni wszystko w porządku, wydruki czarne i kolorowe bardzo dobre. Po 3 dniu, zupełnie nagle, drukarka zaczyna drukować białe poziome kreski na wydrukach kolorowych. W czarnym bardzo dobrze. Wydruki w najlepszej jakości są bardzo dobre. Wydruki w jakości normalnej i roboczej są moim zdaniem wadliwe. Kupiłem 2 drukarki. Jedną udało mi się zwrócić w ramach 14 zwrotu. Druga niestety została. \nProducent HP raz uznał gwarancję. HP przysłałi nową głowicę kolorową, a jak problem nie został rozwiązany, całą nową drukarkę. Trzecia drukarka tak samo, drukuje białe kreski na wydrukach kolorowych. \nZgłoszone ponownie do HP, tym razem w ocenie wsparcia HP, drukarki atramentowe tak drukują... Pozostawię to bez komentarza. Chciałem zgłosić w ramach rękojmi, niezgodność produktu z umową (reklamują outstanding printing quality), ale niestety kupiłem na firmę i rękojmia jest wyłączona. Nie wiem czy wadliwa seria drukarek, głowic, oprogramowania czy może ja coś źle robię przy 1-szym uruchamianiu, ale HP nie chce poznać i rozwiązać problemu. Dobre jest to, że po kilku dniach, pierwsze strony wydruków wychodzą ok, a kreski pojawiają się dopiero na 3-4 stronie. Może z czasem się to poprawi samo, jeśli problemem jest zapowietrzenie głowicy lub aktualizacja oprogramowania sprzętowego... \nCo ciekawe, HP nie wymaga odciągania tuszy strzykawką do wysyłki drukarki a sklep tak. Drugi raz bym nie kupił, chyba że sprawdzoną przetestowaną.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "jakość wydruków"
        ],
        "vote_yes": 19,
        "vote_no": 3,
        "published": "2020-05-28 08:02:51",
        "purchased": "2020-05-04 22:29:44",
        "content_en": "Easy installation. HP Smart software trouble -free. Return of PLN 100 Cashback from the promotion a few days after purchase. Scans. Prints. \nFor the first 2-3 days everything is fine, black and colorful prints very good. After the 3rd day, quite suddenly, the printer begins to print white horizontal lines on colored prints. Very good in Czarny. Printouts in the best quality are very good. Prints in normal and working quality are in my opinion defective. I bought 2 printers. I managed to return one as part of the 14 return. The second unfortunately stayed. \nThe HP manufacturer once recognized the warranty. HP has sent a new colored head, and as the problem was not solved, the whole new printer. The third printer is the same, prints white lines on colored prints. \nReported to HP again, this time in the HP support assessment, inkjet printers print this way ... I will leave it without comment. I wanted to report as part of the warranty, the product's incompatibility with the contract (they advertise the Outstanding Printing Quality), but unfortunately I bought the company and the warranty is turned off. I do not know if a defective series of printers, heads, software or maybe I do something wrong with the 1st start, but HP does not want to know and solve the problem. It is good that after a few days, the first pages of the printout come out ok, and the lines appear only on the 3-4 page. Maybe over time it will improve by itself, if the problem is to announce the head or update the hardware software ... \nInterestingly, HP does not require pulling the carcass with a syringe for shipping the printer and the store yes. I wouldn't buy a second time, unless tested.",
        "pros_en": [
            "pure ink filling",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "Print quality"
        ]
    },
    {
        "opinion_id": "13551598",
        "author": "b...a",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wykonana dobrze, trochę za duża, z ledwością mieści mi się na biurku, ale może być. Drukuje ciszej w porównaniu z poprzednią drukarką HP 209a. Napełniłam tusze do pełna i po ok.10 kartkach ubyło mi 4 mm czarnego tuszu w pojemniku. Mam nadzieję, że będzie wydajna. Na razie nie mogę tego stwierdzić. Fajnie, że można zobaczyć, ile ubyło tuszu. Dolewanie jest banalnie proste, tusz nie wylewa się. Martwi mnie tylko, że przenosić trzeba ją w pozycji poziomej, bo inaczej tusz może się wylewać. Ogólnie jestem zadowolona z zakupu.",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "głośność pracy"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 3,
        "published": "2020-12-10 19:41:04",
        "purchased": "2020-12-04 21:02:01",
        "content_en": "Made well, a bit too big, it barely fits on my desk, but it can be. Prints quieter compared to the previous HP 209A printer. I filled the inks to full and after about 10 cards I lost 4 mm black mascara in the container. I hope it will be efficient. I can't say it yet. It's nice that you can see how much mascara has lost. Putting is very easy, the mascara does not spill. I am only worried that you have to move it in a horizontal position, otherwise the ink may pour out. I am generally satisfied with the purchase.",
        "pros_en": [
            "pure ink filling",
            "volume of work"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "18299406",
        "author": "U...o",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Po 1 dniu uzytkowania mozna stwierdzic 1-polaczenie z kompem poprzez wi fi-bez problemu\n2-tankowanie zbiorniczkow-bez problemu\n3-montaz ,,glowic,,-beznadziejny dostep,jakies pomaranczowe badziewie ciezko wydostac z wnetrza drukarki(po cholere takie zabezpieczenie)ale udalo sie\n4-polaczenie z telefonem -bez problemu\n5-jak z kompa tak i z telefonu(za posrednictwem aplikacji  HP SMART) bez problemow\n6-druk na zwyklym papierze spoko (czern i kolor )\n7-po testach na papierze foto -zobaczymy\n8-ogolnie -za taka kase polecam",
        "pros_pl": [
            "czyste napełnianie atramentem",
            "jakość wydruków",
            "jakość wydruku",
            "niski koszt wydruku",
            "szybkość wydruku",
            "wydajna",
            "wydajność"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-12 21:03:08",
        "purchased": "2024-01-09 18:20:01",
        "content_en": "After 1 day of use\n2-tank tank-attempt\n3-Montaz ,, GLOWIC ,,-hopeless access, some orange crap is hard to get out of the printer's interior (damn such protection) but it went\n4 -Pole with the phone -a problem\n5-like from a computer yes and from the phone (through the HP Smart application) without problems\n6-Drust on ordinary paper cool (black and color)\n7 -work tests on photo paper -we will see\n8 -generalized -I recommend such money for such money",
        "pros_en": [
            "pure ink filling",
            "Print quality",
            "Print quality",
            "low print cost",
            "print speed",
            "efficient",
            "efficiency"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "15226709",
        "author": "k...l",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wszystko z opisu się zgadza. Baaardzo ekonomiczna, jakość druku wysoka, jak na czołg drukarkowy niewielka... Przypomniałem sobie tyko dlaczego nie lubię HP-ków. Mało intuicyjna aplikacja, nie tak denerwująca jak kiedyś ale konfiguracja trwała zbyt długo. A poza tym zupełnie spoko.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2021-11-18 17:47:41",
        "purchased": "2021-11-01 18:36:33",
        "content_en": "Everything in the description is correct. Very economical, the quality of the printing is high, like a small printer tank ... I remembered only why I don't like HP. A little intuitive application, not as annoying as it used to be but the configuration lasted too long. And besides, completely cool.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "11176459",
        "author": "Madziana",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Drukarka od samego początku jest bardzo przyjazna, pierwsze uruchomienie pomimo że na początku wygląda na dość skomplikowane po obejrzeniu szczegółowej instrukcji jest banalnie proste :) Konfiguracje i podłączenie do sieci wi fi trwało bardzo krótko i była wyjątkowo  łatwe :) Drukarka została skonfigurowana została na komputerze oraz smartfonie z androidem, zarówno na komputerze jak i na smarthonie aplikacja do sterowania drukarki jest bardzo przejrzysta i intuicyjna. Na pochwałę zasługuje  aplikacja dla androida która jest konfigurowalna  i można przystosować ją dla swoich potrzeb, jeśli chodzi o wydruk to można przyznać że, drukarka drukuje cicho, bardzo szybko a jakość wydruku zarówno w kolorze czarnym jak i w kolorze jest rewelacyjna :) kolory żywe, wyraziste, obrazki nierozmazane. Mogę oficjalnie przyznać że spełniła moje oczekiwania w wydruku jak i w wyglądzie :)",
        "pros_pl": [
            "jakość wydruków",
            "szybkość wydruku",
            "wydajność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 5,
        "published": "2019-10-19 23:50:49",
        "purchased": null,
        "content_en": "The printer from the very beginning is very friendly, the first start, despite the fact that at the beginning it looks quite complicated after seeing the detailed instructions is very easy :) Configurations and connection to the Wi Fi network took a very short and was extremely easy :) The printer was configured on the computer and Android smartphone, both on the computer and on the smarthon transparent and intuitive. The application for Android deserves praise which is configurable and can be adapted for your needs when it comes to printout, you can admit that the printer prints quietly, very quickly and the quality of the print in both black and color is sensational :) Vibrant colors, expressive, images not fried. I can officially admit that it has met my expectations in the print as well as in appearance :)",
        "pros_en": [
            "Print quality",
            "print speed",
            "efficiency"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "13501735",
        "author": "g...k",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "produkt na wstępie nie ruszył bo był problem z dyszami , po wymianie chodzi  OK , trochę długo i hałaśliwie  trwa proces włączania",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "cons_pl": [
            "głośność pracy"
        ],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2020-12-04 00:11:48",
        "purchased": "2020-11-17 18:04:01",
        "content_en": "The product did not move at the beginning because there was a problem with the nozzles, after the replacement it walks ok, a little long and the process of switching on",
        "pros_en": [
            "Print quality",
            "Print quality",
            "print speed"
        ],
        "cons_en": [
            "volume of work"
        ]
    },
    {
        "opinion_id": "14283834",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Bardzo wydajna i oszczędna drukarka. Solidna, dobra jakość wykonania.\nDługo się czeka przy włączeniu zanim będzie gotowa do pracy. Dość głośna.",
        "pros_pl": [
            "jakość wydruków",
            "jakość wydruku"
        ],
        "cons_pl": [
            "głośność pracy",
            "szybkość wydruku"
        ],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2021-04-14 00:32:31",
        "purchased": "2021-03-23 08:31:21",
        "content_en": "Very efficient and economical printer. Solid, good quality.\nIt has been waiting for a long time when it is ready to work. Pretty loud.",
        "pros_en": [
            "Print quality",
            "Print quality"
        ],
        "cons_en": [
            "volume of work",
            "print speed"
        ]
    },
    {
        "opinion_id": "18283057",
        "author": "u...g",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "urządzenie przy pierwszym użytkowaniu wydaje się dobre. Problem z konfiguracją drukarki w systemie win7 na starszym urządzeniu.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2024-01-08 15:16:39",
        "purchased": "2023-12-18 13:21:12",
        "content_en": "The device at the first use seems good. Problem with the printer configuration in the Win7 system on an older device.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "13654028",
        "author": "p...m",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Drukarka jak na tą cenę jest bardzo słaba, Czas  potrzebny do wydrukowania pierwszej strony to prawie dwie minuty. A odgłosy wydaje takie, jakby za chwilę miała rozpaść się. W tej cenie należałoby też oczekiwać dwustronnego automatycznego wydruku. Wprawdzie info o dwustronnym wydruku jest na stronie sklepu, ale w rzeczywistości nie ma to nic wspólnego z dwustronnym wydrukiem, kartkę trzeba przenosić ręcznie zgodnie z wyświetlona instrukcją.",
        "pros_pl": [],
        "cons_pl": [
            "głośność pracy",
            "jakość wydruków",
            "jakość wydruku",
            "szybkość wydruku"
        ],
        "vote_yes": 6,
        "vote_no": 1,
        "published": "2020-12-26 21:42:32",
        "purchased": "2020-11-26 08:21:40",
        "content_en": "The printer is very weak for this price, the time needed to print the first page is almost two minutes. And the sounds seem as if it would fall apart in a moment. At this price you should also expect a double -sided automatic print. Although the info of a double -sided printout is on the store's website, but in fact it has nothing to do with a double -sided printout, the card must be transferred manually according to the displayed instructions.",
        "pros_en": [],
        "cons_en": [
            "volume of work",
            "Print quality",
            "Print quality",
            "print speed"
        ]
    },
    {
        "opinion_id": "13243464",
        "author": "m...i",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Niestety pierwsze wrazenie po uruchomieniu sprzetu negatywne. Odrazu trzeba bylo skladac reklamacje poniewaz jakosc druku odbiegała od normy. Po zgloszeniu okazalo sie ze jest uszkodzona glowica. Zobaczymy jak przyjdzie nowa glowica czy cos to da. Jaknarazie to wielka porażka a myslalam ze sprzet za ta cene bedzie działał bez zarzutu. Niestety pomyliłam się.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 8,
        "vote_no": 4,
        "published": "2020-10-20 18:00:33",
        "purchased": "2020-10-16 15:51:18",
        "content_en": "Unfortunately, the first impression after starting negative equipment. Immediately it was necessary to make complaints because the quality of print rang from the norm. After reporting, it turned out that the head was damaged. We'll see how the new head comes or something will do it. Yaknarazie is a great failure and I thought that the equipment for this price will work flawlessly. Unfortunately, I was wrong.",
        "pros_en": [],
        "cons_en": []
    }
]